module.exports = {
    "all": [{
        "category": "公选",
        "teacher": "张海鸥",
        "name": "诗词赏析及写作",
        "comments": [{
            "content": "不点名，没上过几节课，质量 25 首词。考试时候自己上去抽签，抽 5 首背诵，每首 10 分，占 50 分。中期作业：填《菩萨蛮》词 一首，占 20 分。期末作业：填《水调歌头》词一首，占 30 分",
            "source": "monsterwong"
        }, {
            "content": "上课从来没点名，老师 我不想背诗就写论文，只有 90 分 .",
            "source": "alwing"
        }],
        "cid": 0
    }, {
        "category": "公选",
        "teacher": "王盛邦",
        "name": "Linux 编程",
        "comments": [{
            "content": "上课水平一般，一百多个人的班 题目先给你。开卷考试，做一个 ftp 就行了。",
            "source": "monsterwong"
        }],
        "cid": 1
    }, {
        "category": "公选",
        "teacher": "罗卫平",
        "name": "美学漫步 —— 从赫西俄德开始",
        "comments": [{
            "content": "这老师也很不错，不点名，随",
            "source": "Badboy"
        }],
        "cid": 2
    }, {
        "category": "公选",
        "teacher": "罗志高",
        "name": "数据库原理与应用",
        "comments": [{
            "content": "需要买书，但是可以到图书馆借",
            "source": "badboy"
        }, {
            "content": "他的书要 30 元，可买可不买，不点名，交过一次 ER 树），一次后作业（ VB 编程），一次大作业",
            "source": "0.05%"
        }],
        "cid": 3
    }, {
        "category": "公选",
        "teacher": "孙力",
        "name": "集邮文化或汽车文化",
        "comments": [{
            "content": "老师挺随和负责的，平时偶尔 ppt ，或写篇论文。如果能把 ppt 弄得比较美观别致，肯定能得高分。",
            "source": "CC"
        }],
        "cid": 4
    }, {
        "category": "公选",
        "teacher": "王盛邦",
        "name": "Visual Basic 程序设计",
        "comments": [{
            "content": "讲课一般，百多人的课只有第一次来的多。简单，懂些 VB 基础就可以高分。",
            "source": "sysujack"
        }],
        "cid": 5
    }, {
        "category": "公选",
        "teacher": "冯双",
        "name": "辩论学",
        "comments": [{
            "content": "好像这学期不在东校区开课，老师挺会吹水的 本是每节课都去。有过两三次\n教材要买，但可以用学长留下的。如这学期只有一题在第一版。90 不是问题。",
            "source": "sysujack"
        }],
        "cid": 6
    }, {
        "category": "公选",
        "teacher": "张志文",
        "name": "国际金融专题",
        "comments": [{
            "content": "考勤+小组ppt专题报告，巨好过.....~",
            "source": "佚名"
        }],
        "cid": 7
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "社会政策分析",
        "comments": [{
            "content": "给分蛮高，80多分貌似排名80多名了。老师讲的内容也不错。我交了一篇论文，期末考试是开卷，但我没有打印他ppt上的内容，幸好老师临时考试放水可以允许借资料,我才不会跪。",
            "source": "佚名"
        }, {
            "content": "老师讲的满无聊的，上课没点过名，上课的话，就讲一下社会热点话题之类的，老师分析也比较口语化，感觉听后也没多大收获，最主要的考试的话，开卷，比较水的，我记得那时候我考前看了点ppt, 资料都不带就去考试了，结果很多题都是要ppt上的，还好老师很好，看见我们不带ppt，还特地说明ppt可以相互的借阅，老师给分也相对较好，这们课很容易过的，高分也相对简单。",
            "source": "佚名"
        }],
        "cid": 8
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "管理学理论与技能开发",
        "comments": [{
            "content": "上课挺好玩的，因为老师比较会扯淡。每节课会点40个人左右的名，不到一次好像会扣4分…不过那老师是秉承60分万岁多一分浪费的观点，感觉给分会比较随意，老师挺人性的。期末考是开卷，考案例分析，找管院的借本书分分钟搞定~ 具体成绩还没出…所以给分到底咋样我也不好说。",
            "source": "佚名"
        }],
        "cid": 9
    }, {
        "category": "公选",
        "teacher": "於梅舫",
        "name": "国学大师和国学",
        "comments": [{
            "content": "点名但是不在也没关系…题目告诉你…开卷…很好过。",
            "source": "佚名"
        }, {
            "content": "这个上课许多人会觉得很无聊，不是你想象中的古色古香，反正我喜欢，不过貌似不开了，他被学校要求讲经学去了好像。",
            "source": "佚名"
        }],
        "cid": 10
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "生态学的弹性思维",
        "comments": [{
            "content": "每周到指定学生那里签到，其实签完到就可以溜了，一般不管。",
            "source": "佚名"
        }, {
            "content": "老师工作态度认真严谨，所以上课内容很多，进度比较快，有兴趣的人选这门课还是可以学到一点东西的，要是混的话当然会觉得无聊。考察主要为一次报告跟最后的论文，报告会有部分优秀的要做展示，也可以有相应的加分，写的时候多扯到课堂内容就可以蛮高分了。",
            "source": "佚名"
        }, {
            "content": "要注意的是，没有PPT，老师会让你买一本书，PPT内容书上都有，不过没有必要买书。所以要高分一定要在课上做好笔记，不然论文写起来会很头痛。",
            "source": "佚名"
        }],
        "cid": 11
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "地球资源学",
        "comments": [{
            "content": "会考勤，一个小组ppt展示，期末是论文～老师挺水的～",
            "source": "佚名"
        }],
        "cid": 12
    }, {
        "category": "公选",
        "teacher": "刘维亮",
        "name": "地质景观与资源",
        "comments": [{
            "content": "老师会不定时点名，但是给分很高，期末一张卷子带回去做的，很简单。",
            "source": "佚名"
        }, {
            "content": "老师讲课很不错，非常风趣，去过蛮多地方，上课都会和你分享，考试开放，平时经常会点名，但只要交了最后的开放考试题都会给你过。",
            "source": "佚名"
        }, {
            "content": "要考勤，给分高，考试试卷带回去做。",
            "source": "佚名"
        }],
        "cid": 13
    }, {
        "category": "公选",
        "teacher": "张古忍",
        "name": "昆虫与人类社会学",
        "comments": [{
            "content": "昆虫昆虫，不点名，不用展示，最后带书去做一张卷子就好了。",
            "source": "佚名"
        }, {
            "content": "不点名，第三节课有好看的昆虫记录片，真心推荐。10块钱买一本书。考试50道判断，50道选择，开卷，在老师摆在网上的课件还有书上都有。考前最好先翻一下~",
            "source": "佚名"
        }],
        "cid": 14
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "岭南饮食文化",
        "comments": [{
            "content": "一般通识，讲吃的发吃的，无考试，但分不算高，会点名。可以作休闲娱乐课。",
            "source": "佚名"
        }],
        "cid": 15
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "从纪录片看全球环境问题",
        "comments": [{
            "content": "不考勤，上课看纪录片，小组ppt加500字感想，不考试，给分还好。",
            "source": "佚名"
        }],
        "cid": 16
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "地球、海洋、生命",
        "comments": [{
            "content": "就是看纪录片，几乎不点名。考试闭卷，考前熟悉PPT就可以。考试题目会问你看过什么纪录片，闭卷考试有论文50分，所以必过。 ",
            "source": "佚名"
        }, {
            "content": "看纪录片的课，只要认真看了，考试前看看资料，也容易。",
            "source": "佚名"
        }, {
            "content": "看记录片，有意思的水课，期末闭卷，看看他的ppt就行。",
            "source": "佚名"
        }, {
            "content": "考勤很松 就最后一节点过名 给分还不错。",
            "source": "佚名"
        }],
        "cid": 17
    }, {
        "category": "公选",
        "teacher": "林文实",
        "name": "地球科学概率",
        "comments": [{
            "content": "上课比较水，一般不点名，交论文。期末貌似开卷。。分数给点还可以。",
            "source": "佚名"
        }],
        "cid": 19
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "现代生命科学技术与人类社会",
        "comments": [{
            "content": "很累水不了，基本是上多次细胞生物学，每节课都一直在讲课。基本每节课都点名，以用一张纸回答问题的形式点名，答案正确错误影响成绩，要写论文，最后也要考试，闭卷，内容是课件上的，课件在邮箱上。分数10%点名，30%3000论文，60%期末老师，考试内容一般，后面的大题目是论述题，说说你对什么的看法，总体不会很难但也是有点难度。",
            "source": "佚名"
        }],
        "cid": 20
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "新材料与人类文明",
        "comments": [{
            "content": "不点名，期末3500字论文，很好过。",
            "source": "佚名"
        }, {
            "content": "过关方式是论文和演讲。",
            "source": "佚名"
        }],
        "cid": 21
    }, {
        "category": "公选",
        "teacher": "杨培娜",
        "name": "海洋文明史",
        "comments": [{
            "content": "只写论文比较好过 就是签到比较麻烦。",
            "source": "佚名"
        }, {
            "content": "老师很好，考勤的话就是偶尔抽查，统计小纸条。只要你对一些历史感兴趣的话还是挺好的，老师给的分数也很高。",
            "source": "佚名"
        }, {
            "content": "老师很可爱，主要是讲历史什么的，觉得无聊可以不去，从不考勤，考试论文一篇，我是自己慢慢写的，花了点时间给分90很推荐！",
            "source": "佚名"
        }],
        "cid": 22
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "急救知识与技术",
        "comments": [{
            "content": "强烈推荐，为数不多的能学到东西的公选课，经常是一开始选课系统开放就没空位的。",
            "source": "佚名"
        }, {
            "content": "不点名，考心肺复苏，闭卷考课上内容，好过，分数也不错～",
            "source": "佚名"
        }, {
            "content": "考心肺复苏，伤者搬运的操作以及闭卷考试。",
            "source": "佚名"
        }, {
            "content": "认真学挺实用。考试是操作+笔试，刷课件就行，两次签到。给分不错。",
            "source": "佚名"
        }],
        "cid": 23
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "全球资源学",
        "comments": [{
            "content": "期末总评按论文和展示给分，老师基本不点名，可以不去上课，据说平均分90+。",
            "source": "佚名"
        }],
        "cid": 24
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "个人健康修养",
        "comments": [{
            "content": "两次平时作业，一次ppt展示，给分还可以，就是有点麻烦啦",
            "source": "佚名"
        }],
        "cid": 25
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "个人健康的自我管理能力发展",
        "comments": [{
            "content": "平时点完名就走，平时两篇小论文，期末小组展示和网上做题，简单，给分比较高。",
            "source": "佚名"
        }, {
            "content": "微坑，不过给分不错。每节课课前签到，两次作业一次上机考试+期末展示。",
            "source": "佚名"
        }, {
            "content": "老师讲课挺好的，可是没那么多时间听-_-||有签到，不点名，小组展示，平时两个小作业～易过哦～",
            "source": "佚名"
        }],
        "cid": 26
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "大学生健康",
        "comments": [{
            "content": "从不点名，考试抄PPT。",
            "source": "佚名"
        }],
        "cid": 27
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "大学生体质健康及个人运动处方实施",
        "comments": [{
            "content": "老师很水，我那届没点过名，不知以后还是不是这样哦～上课很无聊 。\n如果按照老师要求完成平时作业，给分挺高～上个学期的期末考试方式变成了看一个视频写500字的感想（听舍友说的 ）。\n",
            "source": "佚名"
        }, {
            "content": "不点名。上课比较无聊。很容易过，给分不错。要到生物岛玩然后要发照片给老师。",
            "source": "佚名"
        }, {
            "content": "不点名不考试去生物岛照个照片交作业，我一学期就去了三节课，炒鸡好过~",
            "source": "佚名"
        }],
        "cid": 28
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "食品营养与健康",
        "comments": [{
            "content": "考勤略变态，每周都点名，抽点某个学院的人，但是只要某一次点名被点到有来就行（哪怕点了三次只到一次都没关系），不定时点名，有时第一节，有时第三节。",
            "source": "佚名"
        }, {
            "content": "上课内容以介绍食物属性及相关菜肴为主，个人感觉比较水，没什么实质上有用的内容，混学分可以，而且是核心，考察方式为一次查找资料的作业跟最后的论文，很容易过。不过给分偏低，上90分的只有几个人。",
            "source": "佚名"
        }],
        "cid": 29
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "化学与健康",
        "comments": [{
            "content": "辐射的老师讲的是物理和医学方面较多所以会比较无聊 ，老师还会挑几篇好地进行演讲，我的在其中，如果想拿90以上最好写好点演讲的都比较分高。",
            "source": "佚名"
        }],
        "cid": 30
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "女性生理与保健",
        "comments": [{
            "content": "老师很认真，几乎每堂课都有点名，应该可以学到一些有用的东西，但是呢，每次上完课，总感觉怪怪的，哈哈哈，你们自己上过，就知道厉害拉~",
            "source": "佚名"
        }, {
            "content": "是开卷考试，不过大多数内容一般只在老师的课堂上讲出来，课件上是没有的，所以得好好听课。",
            "source": "佚名"
        }],
        "cid": 31
    }, {
        "category": "公选",
        "teacher": "黄盛丰",
        "name": "衰老与抗衰老",
        "comments": [{
            "content": "有考勤，但是他会告诉你什么时候要点名，突击的只有一次，考试为写一篇小论文加答一些题目，题目是事先给的，可先写好，上课内容涉及部分专业知识。",
            "source": "佚名"
        }],
        "cid": 32
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "网络安全与防御",
        "comments": [{
            "content": "签到。主要是网络防御方面的，如果没有基础建议不要去，听不懂，当然感兴趣的话很推荐。不考试，平时有作业，上学期共4次，做不出来没关系，重要的是你去做了。给分还行。",
            "source": "佚名"
        }],
        "cid": 33
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "计算机网络",
        "comments": [{
            "content": "每节课都点名，机房上课，有实验，要写实验报告，内容涉及部分专业知识，考试为闭卷，有题库，都是计算机等级考试的题目，类型为选择，填空，论述，考前需看一看，背一背，给分还算可以。",
            "source": "佚名"
        }],
        "cid": 34
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "计算机基础",
        "comments": [{
            "content": "强烈推荐，强烈推荐。他的课幽默风趣，实际操作能力能得到很大的提高，为人有善良和蔼年轻有礼貌，更重要的是他不会那么狠，考试题目都是从题库中出的，就算上课没认真听也木有关系！",
            "source": "佚名"
        }, {
            "content": "这个课每次都要点名的！注意下。",
            "source": "佚名"
        }],
        "cid": 35
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "网络技术与应用",
        "comments": [{
            "content": "这门课，点名很多，如果你想翘的话，最好拉一个不翘课的同学一起报，这门课平时还要做实验，实验就是一些相对比较有用的东西，比如安装操作系统等，实验之外，还要做一些网上的习题，但是这些题都有答案的，其实我、学了这门课，能记起的，可能只有安装操作系统了，课堂上讲的都是比较虚的一些内容比如什么网络协议之类的，网络安全技术的一些内容是不交的，考试的话，很容易过的，都是原题，老师会给题库，考前看看背背就可以了，但是要是这些时间都不想花的话，那就没办法了。这门课也是话时间比较多的一门课。",
            "source": "佚名"
        }],
        "cid": 36
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "英语传媒与文化",
        "comments": [{
            "content": "老师给分挺高，但要期中期末考，还有平时的听写作业，还要期末的论文。",
            "source": "佚名"
        }],
        "cid": 37
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "英语国家与文化",
        "comments": [{
            "content": "比较难但是收获蛮大的一门公选，不过英语渣者慎选...",
            "source": "佚名"
        }],
        "cid": 38
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "中国典籍英译",
        "comments": [{
            "content": "上到十七周每周连上四节有点辛苦，老师人超nice，从不点名，有事和她说一声就OK。不考试，大Presentation和1000字作文考核，后几周不用展示都不用来。课程有一定难度，推荐真爱者来。分极高，据说89垫底，我拿了4.8还排全班第六",
            "source": "佚名"
        }, {
            "content": "建议不要和英语课同一天上，因为很累。老师很好人。会分组。记得抱大腿，找个好的学姐学长带你。呃呃，选读的东西有论语，四书五经之类的。上课教无聊.没作业。期末展示一次，论文一篇。我很随便是考了95，排名倒数，老师给分很高。",
            "source": "佚名"
        }, {
            "content": "任务偏多，算是点名，不过4分，不要太过分，就都能过。",
            "source": "佚名"
        }],
        "cid": 39
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "全球化与跨国主义",
        "comments": [{
            "content": "老师从来不点名（她甚至没有打印学生名单。。）",
            "source": "佚名"
        }, {
            "content": "比较坑爹的是要上到17周。",
            "source": "佚名"
        }, {
            "content": "上课内容很精彩，可以接触了解到一些跟自己专业没关系的内容，拓展一下知识面，只是老师上课时一股脑地灌理论知识，有点枯燥无味。",
            "source": "佚名"
        }, {
            "content": "考察方式是由6次作业组成（因为是当堂完成作业，所以也可以在改作业的时候顺便知道考勤情况），根据课堂上的内容就某一部电影的某一方面进行论述（这也意味着我们隔一两周看一部电影），只要上课都来，在有测试的那堂课之前看看PPT，论述的时候尽量运用上在课上讲到的内容就可以很高分。",
            "source": "佚名"
        }],
        "cid": 40
    }, {
        "category": "公选",
        "teacher": "郑岩芳",
        "name": "美国社会与文化",
        "comments": [{
            "content": "做个ppt展示就哦了，分数也不低，除了上课要上到17周这一个缺点。从不考勤！",
            "source": "佚名"
        }],
        "cid": 41
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "澳洲社会与文化",
        "comments": [{
            "content": "偶尔点名，一篇论文，老师人很好，上课会给你很多思路提示的，可以在这些思路里选你感兴趣的写论文，也可以按自己思路写。",
            "source": "佚名"
        }],
        "cid": 42
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "法国文明史",
        "comments": [{
            "content": "不考勤，开卷。",
            "source": "佚名"
        }],
        "cid": 43
    }, {
        "category": "公选",
        "teacher": "李洪义",
        "name": "遗传与疾病",
        "comments": [{
            "content": "很闷，逃课率很高，很容易选 给分不算高。",
            "source": "alwing"
        }],
        "cid": 44
    }, {
        "category": "公选",
        "teacher": "陈争",
        "name": "遗传病的诊断与预防",
        "comments": [{
            "content": "每次都要签到，可以让同学带你签名，不点名。给分高，试卷回去看PPT做，除了有点无聊都可以啦~",
            "source": "佚名"
        }],
        "cid": 46
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "发育生物学",
        "comments": [{
            "content": "有签到，每节课都会点人回答问题。期末开卷，题目不难。",
            "source": "佚名"
        }],
        "cid": 47
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "Access数据库",
        "comments": [{
            "content": "老师讲内容很多，当然access对我们大家都是会很有用的一门技术，老师上课偶尔点名，这门课的作业量相对较多，而且这些学习的内容很多，如果真想掌握的话，时间还真的花的不少的，考试的话 开卷，很多题都是原题或者类似的题的，如果你平时多access一点都不懂，考试想直接裸考的话，这门课肯定不行的，总之这门是一门比较费时，但是十分有用的课，具体难不难挂科之类的，只要你平时有认真了，高分没问题的。",
            "source": "佚名"
        }],
        "cid": 48
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "英语演说的艺术",
        "comments": [{
            "content": "比较难但是收获蛮大的一门公选，不过英语渣者慎选...",
            "source": "佚名"
        }],
        "cid": 49
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "中国司法制度",
        "comments": [{
            "content": "比较无聊，但好过。",
            "source": "佚名"
        }],
        "cid": 50
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "辐射与健康",
        "comments": [{
            "content": "辐射的老师讲的是物理和医学方面较多所以会比较无聊 ，老师还会挑几篇好地进行演讲，我的在其中，如果想拿90以上最好写好点演讲的都比较分高。",
            "source": "佚名"
        }],
        "cid": 51
    }, {
        "category": "公选",
        "teacher": "朱沆",
        "name": "家族企业管理",
        "comments": [{
            "content": "他的课还是讲得还是挺有内容 给平时课件（个人研究心血） ppt ，考试不太难，两道题论述题，如果平时有做笔记的话，应该不难",
            "source": "Image"
        }, {
            "content": "讲话慢条斯理但是满怀热忱的 不点名不考勤但是不能过的同学要到。肯定能学到东西 据说下学期他会开的是战略管",
            "source": "G.ar∮ie.ld"
        }],
        "cid": 52
    }, {
        "category": "公选",
        "teacher": "邵冲",
        "name": "当代西方管理思想",
        "comments": [{
            "content": "几乎不点名，期末开卷选择题，PPT上都有，给分高",
            "source": "yuzit"
        }],
        "cid": 55
    }, {
        "category": "公选",
        "teacher": "梁永宽",
        "name": "项目管理",
        "comments": [{
            "content": "给分高，老师幽默风趣，偶尔点名，期末考就当堂策划大学城环跑。",
            "source": "yuzit"
        }],
        "cid": 58
    }, {
        "category": "公选",
        "teacher": "刘华",
        "name": "如何当律师",
        "comments": [{
            "content": "给分一般，课讲的很好，很深刻，不点名，期末考开卷简答题。",
            "source": "yuzit"
        }],
        "cid": 59
    }, {
        "category": "公选",
        "teacher": "刘华",
        "name": "西方法律和法治",
        "comments": [{
            "content": "给分一般，不点名，期末考开卷简答题，课讲得还行",
            "source": "yuzit"
        }],
        "cid": 60
    }, {
        "category": "公必",
        "teacher": "王仕民",
        "name": "思想道德修养与法律基础",
        "comments": [{
            "content": "每节课点名，缺勤一次扣10分，期末成绩比重不大，平时常常课堂作业，给分一般",
            "source": "yuzit"
        }],
        "cid": 61
    }, {
        "category": "体育",
        "teacher": "罗微",
        "name": "跆拳道",
        "comments": [{
            "content": "奥运冠军，上课挺好的，需要跆拳道服，期末太极一章加几个动作，给分一般",
            "source": "yuzit"
        }],
        "cid": 62
    }, {
        "category": "公必",
        "teacher": "蒋经华",
        "name": "高等数学",
        "comments": [{
            "content": "老师讲课时挺好的，就是比较严格，给分很客观，绝对没有师生情",
            "source": "佚名"
        }],
        "cid": 54
    }, {
        "category": "体育",
        "teacher": "凌丽平",
        "name": "羽毛球",
        "comments": [{
            "content": "老师上课还是很怕死的，经常叫我们一定要做开运动，给分挺高的",
            "source": "佚名"
        }],
        "cid": 53
    }, {
        "category": "专选",
        "teacher": "潘茂林",
        "name": "Web 2.0程序设计",
        "comments": [{
            "content": "超级好笑的老师，经常出各种状况",
            "source": "佚名"
        }],
        "cid": 57
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "生态毒理学",
        "comments": [{
            "content": "有三到四次签到，不过给分还好，期末是开卷考",
            "source": "佚名"
        }],
        "cid": 18
    }, {
        "category": "公选",
        "teacher": "胡汝为",
        "name": "食品安全法律之门",
        "comments": [{
            "content": "法学院的老师，所以会偏法律。很认真挺可爱的老师， 只要来考了就能及格开卷题目 但是认真听还是不错的 ~ ！",
            "source": "G.ar∮ie.ld"
        }, {
            "content": "讲一些食品安全问题，案例，比如苏丹红、瘦肉精，上课很有趣，不会听得睡着，考试前会给范围和ppt，几乎就是考题了，可早退，可睡觉",
            "source": "佚名"
        }, {
            "content": "上过的都懂的~ 一个超级赞的又美又智慧的女老师 我一直在想啥时候我能变成她那样就好了 这个老师本科研究生是法学院的，博士是政务院的 现在在公共卫生学院，主要研究领域好像就是食品安全 中间不下课，本来是三节课的，连上不到两小时就下课，考前最后一节课给题准备就好啦 不过今年教务处不许用电脑，所以考试时没有打印带着电脑的同学就悲剧了， 这个老师讲的内容其实好好，觉得和专业课水准差不多 所以有时候去听听也蛮有益的",
            "source": "佚名"
        }],
        "cid": 45
    }, {
        "category": "公选",
        "teacher": "梁丹",
        "name": "现代生命科学与人类社会",
        "comments": [{
            "content": "上课大部分是高中的生物知识，会有很多有趣的图片，平时会给一两个小问题现场答，当做平时成绩加点名，可以叫人帮忙写的\n闭卷,范围就是上课的ppt，高中生物有点印象的基本都可以过",
            "source": "佚名"
        }],
        "cid": 63
    }, {
        "category": "公选",
        "teacher": "肖瑜",
        "name": "战后中苏关系史",
        "comments": [{
            "content": "不在谭毅、朱崇科之下，经典得没法说了。本人听过的最好的。老师上课很生动诙谐，同时也能给我们很多思考，开拓了我们看待问题的角度与范围。我觉得这门课非常不错，闭卷",
            "source": "佚名"
        }, {
            "content": "推荐肖瑜的课。可以学到东西，有体会。我上过战后中苏关系史。有上课考试就不难。不点名，所以逃课应该挺容易的，但是不知道考试会不会悲剧？就我个人来讲，我是舍不得逃的",
            "source": "佚名"
        }, {
            "content": "肖老师师从国内俄国史权威沈志华老师，这门课程的设置也基本是按照沈老师的书来编排的，由于肖老师本身曾经参与过相关的考究工作，所以课堂的文献资料是非常齐全的，而且是不断更新的，学完能令人受益匪浅。更重要的是肖老师本人具有非常严谨的治学精神，也很善于与学生交流，其个人见解方面也是别具一格的。其受欢迎程度从其人人网的好友数量可见一斑",
            "source": "佚名"
        }, {
            "content": "很不错，真的很好，就是考试很难，认真听老师讲都能听懂.不认真绝对会挂科。逃课很多一定会挂科，不要轻易选。\n作业;展示,一篇读书笔记3000-5000（要读600页的书后才能搞定展示）",
            "source": "佚名"
        }],
        "cid": 64
    }, {
        "category": "公选",
        "teacher": "黎红雷",
        "name": "中国古代管理智慧",
        "comments": [{
            "content": "真的想去学东西可以上这个课，老师是哲学系系主任，就上课要求严格一些.平时是要差不多下课的时候当堂交作业的，9次作业，有一次优就等于期末有40分了",
            "source": "佚名"
        }, {
            "content": "几乎每次都有课堂作业。会请他的学生或朋友来讲座.会给你 一个比较广阔的视野.一般我上完课心情都是很愉快的",
            "source": "佚名"
        }],
        "cid": 65
    }, {
        "category": "公选",
        "teacher": "罗志宏",
        "name": "中国考古学与文明进程",
        "comments": [{
            "content": "好，期末论文",
            "source": "佚名"
        }],
        "cid": 66
    }, {
        "category": "公选",
        "teacher": "杨权",
        "name": "周易基础",
        "comments": [{
            "content": "最好是对周易有一点了解去听，才会很有收获。不过其中有一节课教算卦好玩又有用，交一篇和周易相关小论文，一学期会抽查点名1~2次，分数大部分在80以上\n",
            "source": "佚名"
        }, {
            "content": "其实中间的时候会要你在给出的四个卦中挑一个解出来，并发到指定电子邮箱中，由老师挑选出几个解得不错的同学出来做成ppt讲给全班人听，与周易相关的论文需要不少于2000字",
            "source": "佚名"
        }],
        "cid": 67
    }, {
        "category": "公选",
        "teacher": "关红玲",
        "name": "走进香港经济",
        "comments": [{
            "content": "关红玲老师是港澳研究中心的一名老师。这门公选课，顾名思义便是讲述香港的经济，主要是从近代开始讲起。很多时候，老师会讲一些故事，名人轶事，然后中大曾经发生过的一些灵异事件。通过这些事情了解香港的社会、教育、民生、经济层面，乃至是政治层面。个人觉得，如果你在大学去趟香港，当然是不纯粹地购物的话，那么通过这门课了解香港的一些相关知识的话，是会让你更加理解如今的香港和喜欢上香港。有个小组作业，老师会在第一节课上的时候给一个题目，然后自行组队进行小组展示，难度不算是很大。期末作业是写一个三千到八千的论文，不会点名，偶尔的点名只是作为平时的加分项",
            "source": "佚名"
        }],
        "cid": 68
    }, {
        "category": "公选",
        "teacher": "关红玲",
        "name": "组织行为学",
        "comments": [{
            "content": "讲解很一般，理论性强没有什么吸引力，平时会有讨论课，发言有加分",
            "source": "佚名"
        }, {
            "content": "内容充实，但老师讲课欠佳，较为沉闷。课程论文，不点名。",
            "source": "佚名"
        }],
        "cid": 69
    }, {
        "category": "公选",
        "teacher": "毛玮",
        "name": "《诗经》导读",
        "comments": [{
            "content": "争议很大的一门课。老师来自法学院，讲《诗经》的时候也是从各种稀奇古怪的角度出发，而且部分内容比较邪恶...（比如，这位老师习惯性把所有诗经句子扯到原始人的性启蒙上..）如果你是一个比较喜欢猎奇的同学，这门课可能给你很多不一样的简介。但如果你是一名传统的同学的话，这位老师会毁掉你对诗经的任何好印象。期末考难度不大。诗经的背诵默写。",
            "source": "佚名"
        }],
        "cid": 70
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "转基因动物克隆安全与争议",
        "comments": [{
            "content": "200人的教室每次去都只是19人左右。有童鞋误以为是自习室。中途会换一个老师，女老师挺不错的~每节课要不点名要不小测试作为点到方式，没来不扣分，去了加分。分不是很高。",
            "source": "佚名"
        }],
        "cid": 71
    }, {
        "category": "公选",
        "teacher": "丘志力",
        "name": "珠宝玉石鉴赏",
        "comments": [{
            "content": "严重推荐",
            "source": "佚名"
        }],
        "cid": 72
    }, {
        "category": "公选",
        "teacher": "张龙林",
        "name": "中美关系史",
        "comments": [{
            "content": "上课好（前提是对中美关系感兴趣的），但是考试很烦；讲的内容比较官方化 没有什么新颖的历史结论，比较枯燥乏味；备课认真，能学到东西；很好玩，老师很有激情，作业考试要求有点高，但可以学到很多东西；老师很负责，但也很保守，适合想学到东西的同学去；老师真的很棒！！以至于不想逃课，宁可逃语文课也不逃这门公选课。\n开卷；简答+论述；小组讨论写研究报告+个人读书报告+开卷考试；期中读书报告，期末开卷考试（共三道问答题）\n人太少时会考勤；抽查；很严格，几乎每节课都会以小组形式来点名；点名不超过三次",
            "source": "佚名"
        }],
        "cid": 73
    }, {
        "category": "公选",
        "teacher": "罗蔚茵",
        "name": "照亮世界的物理学",
        "comments": [{
            "content": "课程会讲述有关光学电磁学相对论等关于物理的基础知识以及在各个方面的应用实例，老师讲课耐心且带有趣味性。考试以论文及互相评价方式给分。不签到。给分比较合理平均分在85分左右。\n",
            "source": "佚名"
        }, {
            "content": "这是一门非常值得推荐的课，老师学识渊博，平易近人，教给同学“从生活中发现物理”，提出“我要给你们的不是干粮，而是进入森林的猎枪”，老太太非常热爱科学，是物理界的权威，和北大教授出过一系列物理教材，并获国家一等奖。非常非常令人尊敬。还给我们看了很多她游历世界很多国家的资料，从生活中体味物理。论文3000字以上。",
            "source": "佚名"
        }],
        "cid": 74
    }, {
        "category": "公选",
        "teacher": "关红岭",
        "name": "西方经济学",
        "comments": [{
            "content": "超级无聊，没作业，有中段考，是准备逃课人士之佳选，不点名。",
            "source": "佚名"
        }],
        "cid": 77
    }, {
        "category": "公选",
        "teacher": "黄凡",
        "name": "文艺复兴之旅",
        "comments": [{
            "content": "上课看片，没有考试，就写一篇论文，很高",
            "source": "佚名"
        }],
        "cid": 86
    }, {
        "category": "公选",
        "teacher": "李文珍",
        "name": "未知",
        "comments": [{
            "content": "~~~~~~~~这个很赞!!",
            "source": "lazyorange"
        }],
        "cid": 103
    }, {
        "category": "公选",
        "teacher": "冯芃芃",
        "name": "英语影视文化",
        "comments": [{
            "content": "老师全英讲课很投入，需要全神贯注才能完全跟上。上课会提问，每次课还会通过小组作业形式点名，真不太好混……课堂展示或300字英文影评+平时作业。作业签到（可以帮签）",
            "source": "佚名"
        }],
        "cid": 75
    }, {
        "category": "公选",
        "teacher": "蒋卓勤",
        "name": "饮食与健康",
        "comments": [{
            "content": "几个老师上课，混分神课~也是一节课一个老师，小学期上的时候 每次就去了20人左右，一到考试全冒出来了…… 考试的话，只要有那本课本就很方便了~那本课本可以四处找人借，也可以到教材科去买，巨便宜~不过很快就会卖完，要早去~不点名",
            "source": "佚名"
        }, {
            "content": "貌似没小测吧，这课开了很久了似乎，评论都比较多，上课形式相当于一系列讲座，期末抄书，抄到手软，貌似只有一个会点名，其余不用。\n",
            "source": "佚名"
        }, {
            "content": "跟高中的生物差不多，不过还是能学到一些生活中的与饮食有关的常识，上课很少人来但是从不点名。给分挺苛刻的。",
            "source": "佚名"
        }],
        "cid": 76
    }, {
        "category": "公选",
        "teacher": "赵大英",
        "name": "微观经济学",
        "comments": [{
            "content": "绝对是一门能学到东西的课，反正我把它当专业课来上，每个星期最开心的事情就是上微经了，没有反讽！但绝对不是一门适合混学分的课。用萨缪尔森的教材，但她有自己的一条line，不过考试还是以教材为标准。非常需要平时有听课。平时有时小测。这学期她新加了一项“创业设计”的期末作业，只给了这四个字，没有其他具体要求，估计大部分非岭院的都是写些很水的东西应付过去的。笔试，开卷、全客观题（单选、判断）有时点名",
            "source": "佚名"
        }, {
            "content": "港澳所的老师开的课。开课时间是在小学期，短短四周时间讲完整门微观经济学（强大），有点填鸭教学的感觉。难度介于初级与中级之间。有课堂作业 总之这不是一门好混的课。但是，如果想系统学一些经济学的知识，强烈推荐本门课——毕竟老师太负责了，她是把这门课当专必去要求的。",
            "source": "佚名"
        }],
        "cid": 78
    }, {
        "category": "公选",
        "teacher": "朱崇科",
        "name": "身体意识形态",
        "comments": [{
            "content": "朱老师的大名是众人皆知的，这是老师的新着。对于我等文学门外汉来说上这么有深度的课是有困难的。开始的几次课很有趣、很内涵，不过多上几次之后发现讲得好多重复了。。很严肃，不是来混的。论文或读后感。不点名。给分真实",
            "source": "佚名"
        }],
        "cid": 79
    }, {
        "category": "公选",
        "teacher": "陈洁",
        "name": "青春健康与同伴教育",
        "comments": [{
            "content": "需要小组各合作，内容有青春生理、心理， 考试（一定要分组！她不接受对东西。有打算学东西的同学可以选）给分很高",
            "source": "佚名"
        }],
        "cid": 80
    }, {
        "category": "公选",
        "teacher": "多老师",
        "name": "亲子鉴定",
        "comments": [{
            "content": "很有趣~讲很多案例~考试照抄老师发的讲义\n",
            "source": "佚名"
        }, {
            "content": "可以学到很多的东西 都讲得不错 很注重吸引学生的兴趣会找点明星八卦和自己接手的案例。。。听课的可以学到不少法医方面的东西 不听课的也容易混学分 。不点名",
            "source": "佚名"
        }, {
            "content": "每两节课换一个老师,听名字很有趣..但实际上这门课理论性很强..（讲DNA、遗传物质等）听得很闷.课颇难懂,最终考试会发资料,但颇无用..开卷",
            "source": "佚名"
        }],
        "cid": 81
    }, {
        "category": "公选",
        "teacher": "冯芃芃",
        "name": "美国电影文化与批评",
        "comments": [{
            "content": "这个老师上课还是挺好的，基本上都用英语教授，不过比较通俗易懂，听起来也没什么压力。讲的是好莱坞电影的一些发展历程，与其说电影课我看更像社会课或者历史课，认真听还是能长不少见识的~期中会有一次做pre的展示，小组展示，要求挺高的。要求一篇1500字左右的英语论文，就是用所学过的知识去评价一部电影之类的",
            "source": "佚名"
        }],
        "cid": 82
    }, {
        "category": "公选",
        "teacher": "贺希荣",
        "name": "论语研读",
        "comments": [{
            "content": "讲课深入浅出，很有思想；基本没作业。闭卷 BUT考试之前全部题目告诉你\n。点名\n",
            "source": "佚名"
        }, {
            "content": "老师博学广知，风格独特，如若学生认真，必能学到很多人生哲学。不过喜欢和不喜欢的人占两个极端\n",
            "source": "佚名"
        }, {
            "content": "上课有深度，但是会拖堂，事先给考试题目\n",
            "source": "佚名"
        }, {
            "content": "深刻到你听不懂，抽查论语背诵5句\n",
            "source": "佚名"
        }, {
            "content": "大家都上过的，无作业\n",
            "source": "佚名"
        }, {
            "content": "大多数人都是上过他的近代史课才选的，其实我上论语没多大感觉",
            "source": "佚名"
        }],
        "cid": 83
    }, {
        "category": "公选",
        "teacher": "朱崇科",
        "name": "鲁迅精读",
        "comments": [{
            "content": "老师风趣幽默，讲课积极活跃，非常有吸引力。不过侧重通过少数几篇作品来讲鲁迅先生的生平秩事趣闻等等。翘课人数非常少。写论文，没有字数要求，不点名",
            "source": "佚名"
        }, {
            "content": "有三个小作业，大概300字，随堂都能写，不交也不会影响最后成绩。最后一个大论文，不限字数，大概2000字就行了。老湿非常有个性，偶尔爆粗口，十分带感。分数给分超高，200个大概只有20个没有80分吧",
            "source": "佚名"
        }],
        "cid": 84
    }, {
        "category": "公选",
        "teacher": "孙钒",
        "name": "昆虫世界与人类社会",
        "comments": [{
            "content": "上课有些无聊，前两节课讲课后一节放和昆虫有关的短片。有一次野外捕捉昆虫的活动，自愿参加，笔试，有填空、单选、多选、判断、简答。开卷，努力翻书基本上题目都可以答出来",
            "source": "佚名"
        }],
        "cid": 85
    }, {
        "category": "公选",
        "teacher": "陈义烘",
        "name": "观赏鱼养殖",
        "comments": [{
            "content": "偶尔点名，期末论文pre，给分一般",
            "source": "佚名"
        }],
        "cid": 87
    }, {
        "category": "公选",
        "teacher": "陆勇",
        "name": "Visual Basic 程序设计",
        "comments": [{
            "content": "很苦逼，我其实是挂了的，但老师给我一个60分，及格了…没基础的同学不要选…很难…",
            "source": "佚名"
        }],
        "cid": 88
    }, {
        "category": "公选",
        "teacher": "黎芳",
        "name": "澳洲社会国家与文化",
        "comments": [{
            "content": "老师比较严格，要做presentation,写论文（这个论文要求比较多，有些耗时，不过能学不少东西）不过老师好像不太满意我们对课程知识的掌握程度，有说过下次实行考试制整学期点了三次名",
            "source": "佚名"
        }],
        "cid": 89
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "从二战电影看二战历史",
        "comments": [{
            "content": "从开学到最后，每节课都是看电影。喜欢看有深度的电影的同学可以考虑。当然那些电影不是那些商业大片，甚至很陈旧，很多很沉重，考试很恐怖，虽是开卷，但完全没有任何资料可借鉴（没讲过课，没PPT），不点名，每个学期都会有10个左右不及格，最高分一般不超过85，需要GPA的同学们慎重考虑！",
            "source": "佚名"
        }],
        "cid": 90
    }, {
        "category": "公选",
        "teacher": "何俊国",
        "name": "地球资源学",
        "comments": [{
            "content": "老师人很nice，就是上课喜好夹杂英文。刚开始的几节课内容比较丰富，到后面枯燥些。这学期要求做一个PPT，和一篇关于资源的论文。由于基本所有东西都可以算是地球资源，所以非常容易完成。不点名",
            "source": "佚名"
        }, {
            "content": "要交2000字的论文，跟地球资源或大自然有关的就行。上网找一下，修改就OK了。我是把一篇一万字的论文改成2000多字。这老师有个特点，凡是地球上的东西都是资源。还有一个小组PPT展示（我也没去），当时我去ACFUN找了一些搞笑视频，就让组员拿去放了，据说放了一节课（严重超时），但老师一直狂笑（他们说老师没见过世面，所以才觉得好笑，^_^ 这不是诋毁老师啊哈，开个玩笑而已），只在第一节课去过，期间的签到或者点名都是朋友帮忙。",
            "source": "佚名"
        }, {
            "content": "其实课不好听,老师主要扯他的一些野外调查时的见闻,有presentation",
            "source": "佚名"
        }, {
            "content": "一个字;好 选了不后悔………… 上课看风景 考试写论文 分数随你要，一般85左右 ——我上的时候是这样",
            "source": "佚名"
        }, {
            "content": "孔雀石老师超级好玩，上课很有趣的，目前唯一一门我想听的公选~基本只讲了前几节课，后面的都不讲，都是同学在做展示，任何内容都可以（按孔雀石老师的话，很难找到不是属于地球资源的东西来展示）可惜不是核心课程",
            "source": "佚名"
        }, {
            "content": "这个很轻松，挺好玩的.一般提前半个多小时下课，这个老师很搞，也挺前卫，曾经跟我们一起在课堂上看 篮球火 上课也是看视频看图片再讲点理论的东西。偶尔点名",
            "source": "佚名"
        }],
        "cid": 91
    }, {
        "category": "公选",
        "teacher": "卢丹琪",
        "name": "观赏鱼养殖",
        "comments": [{
            "content": "老师很松，上课很无聊，看兴趣吧……\n一篇观赏鱼养殖心得。每学期三次不定期签到，签到在第一节课下了之后，易得高分。\n\n",
            "source": "佚名"
        }, {
            "content": "念PPT，无作业，给分高",
            "source": "佚名"
        }],
        "cid": 92
    }, {
        "category": "公选",
        "teacher": "王朝东",
        "name": "国际制度与国际组织",
        "comments": [{
            "content": "老师讲课很有趣，很敢讲，针砭时弊，非常好，上课形式多样，能充分发挥学生的主观能动性.要求上课关机，期中闭卷考试、期末开卷考试(开卷考试无从准备，完全靠个人积累)\n点名",
            "source": "佚名"
        }],
        "cid": 93
    }, {
        "category": "公选",
        "teacher": "未知",
        "name": "红楼梦专题研究",
        "comments": [{
            "content": "老师人还是很好的。讲课内容比较多篇幅放在曹雪芹身世、红楼梦版本、红学流派等上面。考试题目好BT 细节问题较多，没有系统看过《红楼梦》一两遍的同学可能会觉得很难（甚至超难，除非你能翻书一翻一个准）。 讲课还行 就是扯太远了 ，开卷不点名",
            "source": "佚名"
        }],
        "cid": 94
    }, {
        "category": "公选",
        "teacher": "赵飞英",
        "name": "护理与健康",
        "comments": [{
            "content": "讲课很有趣，可以学到挺多东西的，试卷提前发，开卷，以调查问卷的形式点名，给分很高\n\n\n",
            "source": "佚名"
        }, {
            "content": "讲课一般，开卷，考PPT，一次，做问卷的形式，但可以在下节课做，给分一般\n\n",
            "source": "佚名"
        }, {
            "content": "一共有四个老师分专题上课，其中有一个很风趣，讲授内容也挺实用。最后考试前会给题目，开卷，不签到\n",
            "source": "佚名"
        }, {
            "content": "内容对于生活很实用，考试难度不大，没有课堂展示。需要签到计算平时分。",
            "source": "佚名"
        }],
        "cid": 95
    }, {
        "category": "公选",
        "teacher": "李思涯",
        "name": "科幻电影与后现代",
        "comments": [{
            "content": "这个老师是真不错，上课就是看科幻电影，像什么《黑客帝国》《银翼杀手》大家一起在教室看电影的感觉真不错。每看两三部就让我们进行小组讨论，一开始就会分好组的，然后小组内再组队，对前两次看的电影在小组内做个展示，老师会给出思考的方向，关于什么自我认同之类的问题，蛮有意义的。也可以从中开拓了自己的思维。有一篇论文。我觉得这个课很轻松很轻松很欢乐很欢乐，有三个大题，每一题都是谈谈自己对哪个电影的期中情节的看法之类的，貌似木有点过名，给分不错",
            "source": "佚名"
        }],
        "cid": 96
    }, {
        "category": "公选",
        "teacher": "张鹏",
        "name": "思考人类的本性",
        "comments": [{
            "content": "老师好得没得说，这算是难得的一位不用点名留住学生的老师，但是节节课都能够爆满，我很幸运当时不知道为啥选了他的课，老师是日本学成回来的博士，在猴子这一块算得上中国顶尖的学者，上课旁征博引，还经常课间给我们看一些日本关于猴子的综艺节目，他还会给我们介绍很多野外考察的经验和小故事，而且最最吸引人的是他同样不用考试，期末交上一份论文，据说他不会让交了论文的学生挂科。我的分数还算比较高，95。但是说实在，就算他给我80分，我也觉得上这门课值得了。论文不点名给分高",
            "source": "佚名"
        }, {
            "content": "这课真的让我学到了很多东西,至少学会了以人类学的角度看一些问题！可以说很松，但是我不同意很水的说法,至少我选到的这两门课老师都教的很认真，当然 他们对待考勤和考试是比较松的。",
            "source": "佚名"
        }, {
            "content": "听起来是哲学 其实是讲的各种猴子 老师很搞笑 无平时作业 上课很欢乐\n。一篇家乡猴子的论文",
            "source": "佚名"
        }],
        "cid": 97
    }, {
        "category": "公选",
        "teacher": "叶克难",
        "name": "现代生物技术导论",
        "comments": [{
            "content": "讲的差不多都是高中生物书（选修三）的内容，内容没啥。他会要求写一篇论文，题目由他定，又给几个题目让你任选一个来写2500字的论文。开卷，会给ppt，要求你根据ppt来回答问题。不点名。70分以上。\n",
            "source": "佚名"
        }, {
            "content": "个人觉得可以讲难一点，有些部分还没有高中课本讲得深入具体，若能增加与学生互动更好，期末只要把PPT打印出来并看过一次就可过关，1论文6个题目选1个，写综述，开课后第十周前交给任意一位任课老师",
            "source": "佚名"
        }],
        "cid": 98
    }, {
        "category": "公选",
        "teacher": "吴长顺",
        "name": "营销学原理",
        "comments": [{
            "content": "讲求实际，有批判性，内容新颖，开卷，不点名，分数一般，高分很少",
            "source": "佚名"
        }],
        "cid": 99
    }, {
        "category": "专选",
        "teacher": "王青",
        "name": "软件过程改进",
        "comments": [{
            "content": "好变态，hentai",
            "source": "佚名"
        }, {
            "content": "需要 WEB 编程基础，项目比较多，作业量也比较大。主要学习 网页应用 开发",
            "source": "佚名"
        }],
        "cid": 56
    }, {
        "category": "公必",
        "teacher": "李安勇",
        "name": "未知",
        "comments": [{
            "content": "强烈推荐李安勇 \n超级有内涵的一个老师，是我们班好多女生的偶像 \n讲马政经却不局限于马科斯 \n注重西方经济学和马克思政治经济学的对比",
            "source": "susansmile"
        }],
        "cid": 100
    }, {
        "category": "公选",
        "teacher": "刘燕",
        "name": "未知",
        "comments": [{
            "content": "我今个学期选的是 刘燕 老师的课。老师上课挺风趣幽默的。而且不拘泥于课本，比较有 \n批判精神。她上课经常会叫我们看一些视频，类似百家讲坛之类的。 \n平时不会checktheattendance，没有作业，期末没有叫写论文。考试是我们内部考，不 \n提供具体的复习资料，但是提供全部上课用的PPT…… \n总体来说是个很好的老师",
            "source": "susansmile"
        }],
        "cid": 101
    }, {
        "category": "公选",
        "teacher": "刘燕",
        "name": "未知",
        "comments": [{
            "content": "我今个学期选的是 刘燕 老师的课。老师上课挺风趣幽默的。而且不拘泥于课本，比较有 \n批判精神。她上课经常会叫我们看一些视频，类似百家讲坛之类的。 \n平时不会checktheattendance，没有作业，期末没有叫写论文。考试是我们内部考，不 \n提供具体的复习资料，但是提供全部上课用的PPT…… \n总体来说是个很好的老师",
            "source": "susansmile"
        }],
        "cid": 102
    }, {
        "category": "公必",
        "teacher": "Michael",
        "name": "英语",
        "comments": [{
            "content": "选michael会累死 没有半点美国人的幽默",
            "source": "佚名"
        }],
        "cid": 104
    }]
};